Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad
The AnalysisDecomposedMemberLoad class contains information related to decomposed member loads.

Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad._CSCode
The CS code of the decomposed member load.

Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad._StartDistance
The start distance of the decomposed member load.

Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad._EndDistance
The end distance of the decomposed member load.

Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad._StartValue
The start value of the decomposed member load.

Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad._EndValue
The end value  of the decomposed member load.

Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad.CSCode
The CS code of the decomposed member load.

Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad.StartDistance
The start distance of the decomposed member load.

Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad.EndDistance
The end distance of the decomposed member load.

Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad.StartValue
The start value of the decomposed member load.

Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad.EndValue
The end value of the decomposed member load.

Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad.Select
Selects an analysis decomposed member load.

Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad.SelectInstance
DO NOT USE! For internal usage only!